app/services/active_agent_rules_service.rb

  def create_ruleset(content)
    # Determine version based on user's rulesets for this project
    version = if @user
      (@user.rulesets.where(project: @project).maximum(:version) || 0) + 1
    else
      (@project.rulesets.maximum(:version) || 0) + 1
    end

    # Create ruleset with user association
    if @user
      @user.rulesets.create!(
        content: content,
        version: version,
        project: @project
      )
---
SELECT MAX("rulesets"."version") FROM "rulesets" WHERE "rulesets"."user_id" = $1 AND "rulesets"."project_id" = $2  [["user_id", 9], ["project_id", 14]]
INSERT INTO "rulesets" ("project_id", "content", "version", "is_public", "uuid", "created_at", "updated_at", "user_id", "tags", "previous_version_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"