app/controllers/api/v1/dashboard_controller.rb

SELECT "rulesets".* FROM "rulesets" WHERE "rulesets"."user_id" = $1 ORDER BY "rulesets"."created_at" DESC LIMIT $2  [["user_id", 9], ["LIMIT", 1]]
SELECT COUNT(*) FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 9]]
SELECT COUNT(*) FROM "rulesets" WHERE "rulesets"."user_id" = $1  [["user_id", 9]]
---
  def quick_stats
    {
      total_rulesets: current_user.rulesets.count,
      total_projects: current_user.projects.count,
      credits_used_total: current_user.credit_transactions.usage.sum(:amount).abs,
      last_generation: current_user.rulesets.order(:created_at).last&.created_at