app/controllers/api/v1/projects_controller.rb

SELECT MAX("rulesets"."version") FROM "rulesets" WHERE "rulesets"."user_id" = $1 AND "rulesets"."project_id" = $2  [["user_id", 9], ["project_id", 14]]
SELECT "rulesets".* FROM "rulesets" WHERE "rulesets"."user_id" = $1 AND "rulesets"."project_id" = $2 ORDER BY "rulesets"."version" DESC LIMIT $3  [["user_id", 9], ["project_id", 14], ["LIMIT", 1]]
---
  def generate_ruleset
    begin
      # Use Active Agent service for real LLM integration
      service = ActiveAgentRulesService.new(@project, current_user)

      if service.generate_ruleset
        latest_ruleset = current_user.rulesets.where(project: @project).order(:version).last

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
  def set_project
    @project = Project.find(params[:id])