app/controllers/api/v1/projects_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@example.com"], ["LIMIT", 1]]
INSERT INTO "projects" ("user_id", "name", "description", "tech_stack", "dev_identity", "requirements_file_content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    # Use test user for Active Agent testing
    test_user = User.find_by(email: 'test@example.com')
    @project = Project.new(project_params.merge(user: test_user))

    if @project.save

SELECT "rulesets".* FROM "rulesets" WHERE "rulesets"."project_id" = $1 ORDER BY "rulesets"."version" DESC LIMIT $2  [["project_id", 3], ["LIMIT", 1]]
INSERT INTO "rulesets" ("project_id", "content", "version", "is_public", "uuid", "created_at", "updated_at", "user_id", "tags", "previous_version_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT MAX("rulesets"."version") FROM "rulesets" WHERE "rulesets"."project_id" = $1  [["project_id", 3]]
---
  def generate_ruleset
    # Use Active Agent service for real LLM integration
    service = ActiveAgentRulesService.new(@project)

    if service.generate_ruleset
      latest_ruleset = @project.rulesets.order(:version).last

      render json: {
        status: 'success',
        message: '🎉 AI-powered ruleset generated with OpenAI and community insights!',
        data: {
          id: @project.id,
          ruleset_id: latest_ruleset.id,
          version: latest_ruleset.version,
          content: latest_ruleset.content,
          content_preview: latest_ruleset.content[0..300] + '...',
          created_at: latest_ruleset.created_at,
          dev_identity: @project.dev_identity,
          tech_stack: @project.tech_stack,
          word_count: latest_ruleset.content.split.length,
          generator: 'active_agent_openai',
          model: 'gpt-4o',
          community_enhanced: true

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def set_project
    @project = Project.find(params[:id])