app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def current_user
    @current_user ||= begin
      user_data = warden.authenticate(scope: :user)
      if user_data.is_a?(Hash)
        # If warden returns a hash, find the user by ID
        User.find_by(id: user_data['id'])