app/models/credit_transaction.rb

  def self.create_usage_transaction(user, ruleset, amount = -1)
---
INSERT INTO "credit_transactions" ("user_id", "amount", "transaction_type", "description", "ruleset_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def self.create_initial_credits(user, amount = 10)
---
INSERT INTO "credit_transactions" ("user_id", "amount", "transaction_type", "description", "ruleset_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"