app/models/ruleset.rb

SELECT MAX("rulesets"."version") FROM "rulesets" WHERE "rulesets"."project_id" = $1  [["project_id", 1]]
---
  def set_version
    if project.present?
      last_version = project.rulesets.maximum(:version) || 0