app/models/ruleset.rb

SELECT MAX("rulesets"."version") FROM "rulesets" WHERE "rulesets"."user_id" = $1 AND "rulesets"."project_id" = $2  [["user_id", 9], ["project_id", 14]]
---
  def set_version
    if user.present?
      last_version = user.rulesets.where(project: project).maximum(:version) || 0